{"contributing":0,"vllm":1,"you":2,"may":3,"find":4,"information":5,"about":6,"docs":7,"ai":8,"https":9,"en":10,"latest":11,"markdownlint":12,"disable":13,"md001":14,"md041":15,"align":16,"center":17,"picture":18,"source":19,"media":20,"prefers":21,"color":22,"scheme":23,"dark":24,"srcset":25,"raw":26,"githubusercontent":27,"com":28,"project":29,"main":30,"assets":31,"logos":32,"logo":33,"text":34,"png":35,"img":36,"alt":37,"src":38,"light":39,"width":40,"55":41,"h3":42,"easy":43,"fast":44,"cheap":45,"llm":46,"serving":47,"everyone":48,"href":49,"documentation":50,"blog":51,"arxiv":52,"org":53,"abs":54,"2309":55,"06180":56,"paper":57,"vllm_project":58,"twitter":59,"discuss":60,"user":61,"forum":62,"slack":63,"developer":64,"news":65,"2025":66,"08":67,"we":68,"hosted":69,"beijing":70,"meetup":71,"mp":72,"weixin":73,"qq":74,"dgkwg1wfpwgo2jcdtqqhxa":75,"focusing":76,"large":77,"scale":78,"deployment":79,"please":80,"slides":81,"here":82,"drive":83,"google":84,"folders":85,"1pid6nsflu43dzri0eatcpgxsazdvbbqf":86,"recording":87,"www":88,"chaspark":89,"live":90,"1166916873711665152":91,"05":92,"nyc":93,"lu":94,"ma":95,"c1rqyf1f":96,"presentation":97,"1_q_aw_iomjwuimf1s1ym":98,"zhjxz8cuel0ijvaquoybea":99,"edit":100,"usp":101,"sharing":102,"now":103,"under":104,"pytorch":105,"foundation":106,"announcement":107,"welcomes":108,"01":109,"excited":110,"announce":111,"alpha":112,"release":113,"v1":114,"major":115,"architectural":116,"upgrade":117,"7x":118,"speedup":119,"clean":120,"code":121,"optimized":122,"execution":123,"loop":124,"zero":125,"overhead":126,"prefix":127,"caching":128,"enhanced":129,"multimodal":130,"support":131,"more":132,"check":133,"out":134,"our":135,"post":136,"27":137,"html":138,"details":139,"summary":140,"previous":141,"04":142,"asia":143,"day":144,"sginnovate":145,"event":146,"limited":147,"availability":148,"morning":149,"evening":150,"slots":151,"remaining":152,"inaugural":153,"from":154,"team":155,"19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo":156,"03":157,"ollama":158,"inference":159,"night":160,"16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u":161,"first":162,"china":163,"n77gibl2coratqhtveazfg":164,"1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq":165,"east":166,"coast":167,"7mu4k4xx":168,"1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs":169,"slide":170,"id":171,"g31441846c39_0_0":172,"02":173,"ninth":174,"h7g3kuj9":175,"meta":176,"1jzc_pzvxrvnsfvcw":177,"v4cfxb6pn7zz2cyp_flwo05aqg":178,"amd":179,"file":180,"1zk5qejiktmlq2eqcxqzlljax3m9s7nwn":181,"view":182,"posted":183,"eighth":184,"zep56hui":185,"cloud":186,"1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4":187,"1h24phewanyrl11xy5dxubvrc9f9kkjix":188,"2024":189,"12":190,"joins":191,"ecosystem":192,"11":193,"seventh":194,"h0qvrajz":195,"snowflake":196,"1e3cxqbv3jsfgp30swyvs3em_tw":197,"ghohj9pajgk6kr54":198,"1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a":199,"10":200,"have":201,"just":202,"created":203,"coordinating":204,"contributions":205,"discussing":206,"features":207,"feel":208,"free":209,"join":210,"us":211,"ray":212,"summit":213,"held":214,"special":215,"track":216,"opening":217,"talk":218,"1b_kqxphbtra_mdf":219,"tr6i8rwdou5qotznceg2mkzxehm":220,"learn":221,"talks":222,"youtube":223,"playlist":224,"list":225,"plztswpqnepxl6aqwifuwuimlpfrvpksjr":226,"other":227,"contributors":228,"users":229,"09":230,"sixth":231,"87q3nvnh":232,"nvidia":233,"1wrlgwytqfaotd5wcgspnhoaw3nq0e":234,"9wqyp7ny93xrs":235,"07":236,"fifth":237,"lp0gyjqr":238,"aws":239,"1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y":240,"partnership":241,"officially":242,"supports":243,"llama":244,"fp8":245,"quantization":246,"pipeline":247,"parallelism":248,"23":249,"llama31":250,"06":251,"fourth":252,"agivllm":253,"cloudflare":254,"bentoml":255,"1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4":256,"third":257,"robloxandvllmmeetup2024":258,"splashthat":259,"roblox":260,"1a":261,"47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem":262,"second":263,"ygxbpzhl":264,"ibm":265,"12mi2skabnuw5rbwxdyy":266,"hthth4imsnceoq10jdqbxga":267,"2023":268,"a16z":269,"1ql":270,"xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s":271,"would":272,"like":273,"express":274,"sincere":275,"gratitude":276,"andreessen":277,"horowitz":278,"30":279,"supporting":280,"open":281,"community":282,"providing":283,"generous":284,"grant":285,"development":286,"research":287,"released":288,"fastchat":289,"integration":290,"has":291,"powered":292,"lmsys":293,"vicuna":294,"chatbot":295,"arena":296,"chat":297,"since":298,"mid":299,"april":300,"use":301,"library":302,"originally":303,"developed":304,"sky":305,"computing":306,"lab":307,"cs":308,"berkeley":309,"edu":310,"uc":311,"evolved":312,"driven":313,"both":314,"academia":315,"industry":316,"state":317,"art":318,"throughput":319,"efficient":320,"management":321,"attention":322,"key":323,"value":324,"memory":325,"pagedattention":326,"20":327,"continuous":328,"batching":329,"incoming":330,"requests":331,"model":332,"cuda":333,"hip":334,"graph":335,"quantizations":336,"gptq":337,"2210":338,"17323":339,"awq":340,"2306":341,"00978":342,"autoround":343,"05516":344,"int4":345,"int8":346,"kernels":347,"including":348,"flashattention":349,"flashinfer":350,"speculative":351,"decoding":352,"chunked":353,"prefill":354,"flexible":355,"seamless":356,"popular":357,"hugging":358,"face":359,"models":360,"high":361,"various":362,"algorithms":363,"parallel":364,"sampling":365,"beam":366,"search":367,"tensor":368,"data":369,"expert":370,"distributed":371,"streaming":372,"outputs":373,"openai":374,"compatible":375,"api":376,"server":377,"gpus":378,"cpus":379,"intel":380,"powerpc":381,"tpu":382,"neuron":383,"multi":384,"lora":385,"seamlessly":386,"most":387,"huggingface":388,"transformer":389,"llms":390,"mixture":391,"mixtral":392,"deepseek":393,"v2":394,"v3":395,"embedding":396,"e5":397,"mistral":398,"modal":399,"llava":400,"full":401,"supported":402,"supported_models":403,"getting":404,"started":405,"install":406,"pip":407,"getting_started":408,"installation":409,"gpu":410,"index":411,"build":412,"wheel":413,"bash":414,"visit":415,"quickstart":416,"welcome":417,"any":418,"collaborations":419,"how":420,"get":421,"involved":422,"sponsors":423,"compute":424,"resources":425,"testing":426,"following":427,"organizations":428,"thank":429,"your":430,"note":431,"sort":432,"them":433,"alphabetical":434,"order":435,"keep":436,"consistent":437,"md":438,"cash":439,"donations":440,"dropbox":441,"sequoia":442,"capital":443,"skywork":444,"zhenfund":445,"alibaba":446,"anyscale":447,"crusoe":448,"databricks":449,"deepinfra":450,"lambda":451,"nebius":452,"novita":453,"replicate":454,"runpod":455,"trainy":456,"san":457,"diego":458,"sponsor":459,"also":460,"official":461,"fundraising":462,"venue":463,"through":464,"opencollective":465,"plan":466,"fund":467,"maintenance":468,"adoption":469,"citation":470,"cite":471,"bibtex":472,"inproceedings":473,"kwon2023efficient":474,"title":475,"language":476,"author":477,"woosuk":478,"kwon":479,"zhuohan":480,"li":481,"siyuan":482,"zhuang":483,"ying":484,"sheng":485,"lianmin":486,"zheng":487,"cody":488,"hao":489,"yu":490,"joseph":491,"gonzalez":492,"zhang":493,"ion":494,"stoica":495,"booktitle":496,"proceedings":497,"acm":498,"sigops":499,"29th":500,"symposium":501,"operating":502,"systems":503,"principles":504,"year":505,"contact":506,"start":507,"technical":508,"questions":509,"feature":510,"github":511,"issues":512,"fellow":513,"security":514,"disclosures":515,"advisories":516,"partnerships":517,"lists":518,"mailto":519,"end":520,"kit":521,"wish":522,"refer":523,"repo":524,"spdx":525,"license":526,"identifier":527,"apache":528,"filecopyrighttext":529,"copyright":530,"import":531,"ctypes":532,"importlib":533,"util":534,"json":535,"logging":536,"os":537,"re":538,"shutil":539,"subprocess":540,"sys":541,"pathlib":542,"path":543,"which":544,"torch":545,"packaging":546,"version":547,"parse":548,"setuptools":549,"extension":550,"setup":551,"command":552,"build_ext":553,"setuptools_scm":554,"get_version":555,"utils":556,"cpp_extension":557,"cuda_home":558,"rocm_home":559,"def":560,"load_module_from_path":561,"module_name":562,"spec":563,"spec_from_file_location":564,"module":565,"module_from_spec":566,"modules":567,"loader":568,"exec_module":569,"return":570,"root_dir":571,"__file__":572,"parent":573,"logger":574,"getlogger":575,"__name__":576,"cannot":577,"envs":578,"directly":579,"because":580,"depends":581,"installed":582,"yet":583,"py":584,"vllm_target_device":585,"platform":586,"startswith":587,"darwin":588,"cpu":589,"warning":590,"automatically":591,"set":592,"due":593,"macos":594,"elif":595,"linux":596,"only":597,"wsl":598,"building":599,"so":600,"able":601,"run":602,"correctly":603,"empty":604,"none":605,"getenv":606,"available":607,"fallback":608,"main_cuda_version":609,"is_sccache_available":610,"bool":611,"sccache":612,"int":613,"vllm_disable_sccache":614,"is_ccache_available":615,"ccache":616,"is_ninja_available":617,"ninja":618,"is_url_available":619,"url":620,"str":621,"urllib":622,"request":623,"urlopen":624,"status":625,"try":626,"except":627,"exception":628,"false":629,"200":630,"class":631,"cmakeextension":632,"__init__":633,"self":634,"name":635,"cmake_lists_dir":636,"kwa":637,"super":638,"sources":639,"py_limited_api":640,"true":641,"abspath":642,"cmake_build_ext":643,"dict":644,"directories":645,"been":646,"configured":647,"did_config":648,"determine":649,"number":650,"compilation":651,"jobs":652,"optionally":653,"nvcc":654,"compile":655,"threads":656,"compute_num_jobs":657,"num_jobs":658,"either":659,"max_jobs":660,"environment":661,"variable":662,"defined":663,"info":664,"using":665,"else":666,"sched_getaffinity":667,"isn":668,"universally":669,"fall":670,"back":671,"cpu_count":672,"error":673,"len":674,"attributeerror":675,"nvcc_threads":676,"_is_cuda":677,"get_nvcc_cuda_version":678,"when":679,"reduce":680,"avoid":681,"overloading":682,"system":683,"max":684,"perform":685,"cmake":686,"configuration":687,"single":688,"configure":689,"ext":690,"ve":691,"already":692,"cmakelists":693,"txt":694,"exit":695,"early":696,"select":697,"type":698,"optimization":699,"level":700,"debug":701,"default_cfg":702,"relwithdebinfo":703,"cfg":704,"cmake_build_type":705,"cmake_args":706,"dcmake_build_type":707,"format":708,"dvllm_target_device":709,"verbose":710,"dcmake_verbose_makefile":711,"dcmake_c_compiler_launcher":712,"dcmake_cxx_compiler_launcher":713,"dcmake_cuda_compiler_launcher":714,"dcmake_hip_compiler_launcher":715,"pass":716,"python":717,"executable":718,"can":719,"exact":720,"match":721,"dvllm_python_executable":722,"reuse":723,"dependencies":724,"subsequent":725,"calls":726,"dvllm_python_path":727,"override":728,"base":729,"directory":730,"fetchcontent":731,"downloads":732,"root":733,"deps":734,"allows":735,"between":736,"profiles":737,"plays":738,"nicely":739,"fetchcontent_base_dir":740,"fc_base_dir":741,"environ":742,"dfetchcontent_base_dir":743,"tool":744,"dnvcc_threads":745,"build_tool":746,"dcmake_job_pool_compile":747,"string":748,"dcmake_job_pools":749,"default":750,"whatever":751,"picks":752,"make":753,"sure":754,"dcmake_cuda_compiler":755,"bin":756,"check_call":757,"cwd":758,"build_temp":759,"build_extensions":760,"ensure":761,"present":762,"working":763,"check_output":764,"oserror":765,"raise":766,"runtimeerror":767,"create":768,"does":769,"exist":770,"exists":771,"makedirs":772,"targets":773,"target_name":774,"removeprefix":775,"vllm_flash_attn":776,"all":777,"extensions":778,"append":779,"build_args":780,"target":781,"libraries":782,"proper":783,"location":784,"outdir":785,"get_ext_fullpath":786,"absolute":787,"skip":788,"same":789,"continue":790,"appends":791,"contains":792,"need":793,"remove":794,"range":795,"count":796,"should":797,"actually":798,"components":799,"install_args":800,"component":801,"standard":802,"copy":803,"build_lib":804,"current":805,"included":806,"editable":807,"glob":808,"files":809,"recursive":810,"dst_file":811,"split":812,"print":813,"copying":814,"dirname":815,"exist_ok":816,"copy_file":817,"precompiled_build_ext":818,"disables":819,"precompiled":820,"binaries":821,"assert":822,"vllm_use_precompiled":823,"builds":824,"skipping":825,"precompiled_wheel_utils":826,"extracts":827,"existing":828,"staticmethod":829,"extract_precompiled_and_patch_package":830,"wheel_url_or_path":831,"tempfile":832,"zipfile":833,"temp_dir":834,"isfile":835,"wheel_filename":836,"mkdtemp":837,"wheels":838,"wheel_path":839,"downloading":840,"urlretrieve":841,"filename":842,"package_data_patch":843,"files_to_copy":844,"_c":845,"abi3":846,"_moe_c":847,"_flashmla_c":848,"_vllm_fa2_c":849,"_vllm_fa3_c":850,"cumem_allocator":851,"compiled_regex":852,"file_members":853,"filter":854,"filelist":855,"extract":856,"target_path":857,"wb":858,"dst":859,"copyfileobj":860,"pkg":861,"replace":862,"setdefault":863,"basename":864,"finally":865,"removing":866,"temporary":867,"rmtree":868,"get_base_commit_in_main_branch":869,"force":870,"nightly":871,"mainly":872,"used":873,"ci":874,"vllm_test_use_precompiled_nightly_wheel":875,"commit":876,"hash":877,"upstream":878,"branch":879,"resp_json":880,"curl":881,"repos":882,"commits":883,"decode":884,"utf":885,"upstream_main_commit":886,"loads":887,"sha":888,"docker":889,"context":890,"git":891,"immutable":892,"missing":893,"vllm_docker_build_context":894,"local":895,"cat":896,"calledprocesserror":897,"fetch":898,"remote":899,"repository":900,"update":901,"branches":902,"ensures":903,"ref":904,"its":905,"history":906,"current_branch":907,"show":908,"strip":909,"base_commit":910,"merge":911,"valueerror":912,"err":913,"failed":914,"dev":915,"_no_device":916,"has_cuda":917,"_is_neuron":918,"_is_tpu":919,"_is_hip":920,"rocm":921,"_is_cpu":922,"_is_xpu":923,"xpu":924,"_build_custom_ops":925,"get_rocm_version":926,"librocm":927,"core":928,"see":929,"blob":930,"d11f5c20d500f729c393680a01fa902ebf92094b":931,"rocm_version":932,"cpp":933,"l21":934,"librocm_core_file":935,"lib":936,"is_file":937,"librocm_core":938,"cdll":939,"vererrors":940,"c_uint32":941,"get_rocm_core_version":942,"getrocmversion":943,"restype":944,"argtypes":945,"pointer":946,"minor":947,"patch":948,"byref":949,"get_neuronxcc_version":950,"sysconfig":951,"site_dir":952,"get_paths":953,"purelib":954,"version_file":955,"neuronxcc":956,"executed":957,"successfully":958,"fp":959,"content":960,"read":961,"regular":962,"expression":963,"__version__":964,"group":965,"could":966,"output":967,"adapted":968,"apex":969,"8b7a1ff183741dd8f9b87e7bafd04cfde99cea28":970,"nvcc_output":971,"universal_newlines":972,"release_idx":973,"nvcc_cuda_version":974,"get_gaudi_sw_version":975,"returns":976,"driver":977,"enable":978,"console":979,"printing":980,"hl":981,"smi":982,"shell":983,"capture_output":984,"env":985,"enable_console":986,"returncode":987,"stdout":988,"get_vllm_version":989,"write_to":990,"_version":991,"sep":992,"versions":993,"might":994,"contain":995,"cuda_version":996,"cuda_version_str":997,"tarball":998,"required":999,"pypi":1000,"sdist":1001,"argv":1002,"cu":1003,"neuron_version":1004,"neuron_version_str":1005,"unknown":1006,"runtime":1007,"get_requirements":1008,"package":1009,"requirements":1010,"requirements_dir":1011,"_read_requirements":1012,"resolved_requirements":1013,"line":1014,"common":1015,"cuda_major":1016,"cuda_minor":1017,"modified_requirements":1018,"req":1019,"flash":1020,"attn":1021,"built":1022,"unsupported":1023,"ext_modules":1024,"_rocm_c":1025,"fa3":1026,"requires":1027,"later":1028,"optional":1029,"doesn":1030,"produce":1031,"targeting":1032,"hopper":1033,"package_data":1034,"typed":1035,"model_executor":1036,"layers":1037,"fused_moe":1038,"configs":1039,"advance":1040,"wheel_location":1041,"vllm_precompiled_wheel_location":1042,"wheel_url":1043,"cp38":1044,"manylinux1_x86_64":1045,"whl":1046,"resp":1047,"warn":1048,"falling":1049,"items":1050,"extend":1051,"cmdclass":1052,"static":1053,"metadata":1054,"rather":1055,"go":1056,"pyproject":1057,"toml":1058,"install_requires":1059,"extras_require":1060,"bench":1061,"pandas":1062,"datasets":1063,"tensorizer":1064,"fastsafetensors":1065,"runai":1066,"streamer":1067,"13":1068,"s3":1069,"boto3":1070,"audio":1071,"librosa":1072,"soundfile":1073,"mistral_common":1074,"processing":1075,"video":1076,"kept":1077,"backwards":1078,"compatibility":1079,"updated":1080,"together":1081,"dockerfile":1082,"requires_files":1083,"cleaning":1084,"lines":1085,"readlines":1086,"lower":1087,"removed":1088,"write":1089,"done":1090,"cmake_minimum_required":1091,"26":1092,"step":1093,"places":1094,"correct":1095,"example":1096,"mkdir":1097,"cd":1098,"python3":1099,"dcmake_install_prefix":1100,"want":1101,"one":1102,"manually":1103,"vllm_extensions":1104,"languages":1105,"cxx":1106,"overridden":1107,"cache":1108,"device":1109,"backend":1110,"message":1111,"include":1112,"cmake_current_list_dir":1113,"suppress":1114,"potential":1115,"warnings":1116,"unused":1117,"specified":1118,"variables":1119,"ignoreme":1120,"vllm_python_path":1121,"prevent":1122,"cutlass":1123,"cmake_install_local_only":1124,"all_components":1125,"searched":1126,"selected":1127,"sync":1128,"python_supported_versions":1129,"architectures":1130,"hip_supported_archs":1131,"gfx906":1132,"gfx908":1133,"gfx90a":1134,"gfx942":1135,"gfx950":1136,"gfx1030":1137,"gfx1100":1138,"gfx1101":1139,"gfx1200":1140,"gfx1201":1141,"expected":1142,"currently":1143,"having":1144,"incorrect":1145,"results":1146,"than":1147,"derived":1148,"torch_supported_version_cuda":1149,"torch_supported_version_rocm":1150,"exactly":1151,"matches":1152,"vllm_python_executable":1153,"find_python_from_executable":1154,"fatal_error":1155,"desired":1156,"before":1157,"running":1158,"endif":1159,"cmake_prefix_path":1160,"append_cmake_prefix_path":1161,"find_program":1162,"nvcc_executable":1163,"cuda_found":1164,"found":1165,"imports":1166,"partially":1167,"some":1168,"customizations":1169,"do":1170,"explicitly":1171,"check_language":1172,"enable_language":1173,"etc":1174,"find_package":1175,"must":1176,"happen":1177,"after":1178,"cmake_cuda_compiler_version":1179,"gets":1180,"version_greater_equal":1181,"cuda_supported_archs":1182,"forward":1183,"non":1184,"external":1185,"scripts":1186,"strequal":1187,"cpu_extension":1188,"up":1189,"what":1190,"hip_found":1191,"vllm_gpu_lang":1192,"torch_version":1193,"version_equal":1194,"saw":1195,"instead":1196,"elseif":1197,"importing":1198,"recognizes":1199,"sets":1200,"let":1201,"recognize":1202,"understand":1203,"enabled":1204,"rocm_version_dev_major":1205,"greater_equal":1206,"control":1207,"per":1208,"basis":1209,"cut":1210,"down":1211,"time":1212,"cmake_cuda_flags":1213,"applied":1214,"globally":1215,"clear_cuda_arches":1216,"cuda_arch_flags":1217,"extract_unique_cuda_archs_ascending":1218,"cuda_archs":1219,"archs":1220,"cuda_archs_loose_intersection":1221,"detected":1222,"final":1223,"arches":1224,"stored":1225,"vllm_gpu_arches":1226,"override_gpu_arches":1227,"_supported_archs":1228,"query":1229,"additional":1230,"flags":1231,"given":1232,"vllm_gpu_flags":1233,"get_torch_gpu_compiler_flags":1234,"compiled":1235,"part":1236,"process":1237,"play":1238,"each":1239,"dependency":1240,"produces":1241,"artifacts":1242,"binary_dir":1243,"conflicts":1244,"types":1245,"cmake_binary_dir":1246,"make_directory":1247,"overriding":1248,"adding":1249,"ggdb3":1250,"devug":1251,"cmake_":1252,"_flags_debug":1253,"o0":1254,"cmake_cxx_flags_debug":1255,"certain":1256,"functions":1257,"marked":1258,"nodiscard":1259,"ignores":1260,"result":1261,"generates":1262,"lot":1263,"always":1264,"mask":1265,"real":1266,"suppressing":1267,"until":1268,"properly":1269,"addressed":1270,"_flags":1271,"wno":1272,"cmake_cxx_flags":1273,"define":1274,"vllm_cumem_ext_src":1275,"csrc":1276,"set_gencode_flags_for_srcs":1277,"srcs":1278,"enabling":1279,"cumem":1280,"allocator":1281,"link":1282,"against":1283,"cumem_libs":1284,"cuda_driver":1285,"define_gpu_extension_target":1286,"destination":1287,"use_sabi":1288,"with_soabi":1289,"vllm_ext_src":1290,"mamba":1291,"mamba_ssm":1292,"selective_scan_fwd":1293,"cache_kernels":1294,"paged_attention_v1":1295,"paged_attention_v2":1296,"merge_attn_states":1297,"vertical_slash_index":1298,"pos_encoding_kernels":1299,"activation_kernels":1300,"layernorm_kernels":1301,"layernorm_quant_kernels":1302,"sampler":1303,"cuda_view":1304,"q_gemm":1305,"compressed_tensors":1306,"int8_quant_kernels":1307,"fused_kernels":1308,"fused_layernorm_dynamic_per_token_quant":1309,"gguf":1310,"gguf_kernel":1311,"cuda_utils_kernels":1312,"custom_all_reduce":1313,"torch_bindings":1314,"cutlass_enable_headers_only":1315,"header":1316,"cutlass_revision":1317,"fixes":1318,"bogus":1319,"messages":1320,"v4":1321,"revision":1322,"vllm_cutlass_src_dir":1323,"provided":1324,"is_absolute":1325,"get_filename_component":1326,"fetchcontent_declare":1327,"source_dir":1328,"git_repository":1329,"above":1330,"git_tag":1331,"git_progress":1332,"speed":1333,"download":1334,"retrieving":1335,"important":1336,"git_shallow":1337,"works":1338,"names":1339,"tags":1340,"fetchcontent_makeavailable":1341,"gemm_kernels":1342,"permute_cols":1343,"cutlass_w8a8":1344,"scaled_mm_entry":1345,"fp4":1346,"nvfp4_quant_entry":1347,"nvfp4_scaled_mm_entry":1348,"nvfp4_blockwise_moe_kernel":1349,"sparse":1350,"sparse_scaled_mm_entry":1351,"cutlass_extensions":1352,"mla":1353,"cutlass_mla_entry":1354,"per_token_group_quant":1355,"marlin":1356,"least":1357,"sizes":1358,"shapes":1359,"machete":1360,"bf16":1361,"atomicadd":1362,"ptx":1363,"marlin_archs":1364,"generate":1365,"preselected":1366,"input":1367,"pairs":1368,"schedules":1369,"marlin_gen_script":1370,"cmake_current_source_dir":1371,"gptq_marlin":1372,"generate_kernels":1373,"md5":1374,"marlin_gen_script_hash":1375,"generation":1376,"script":1377,"last":1378,"execute_process":1379,"cmake_command":1380,"pythonpath":1381,"python_executable":1382,"result_variable":1383,"marlin_generation_result":1384,"output_variable":1385,"output_file":1386,"cmake_current_binary_dir":1387,"marlin_generation":1388,"log":1389,"error_file":1390,"equal":1391,"ncheck":1392,"completed":1393,"changed":1394,"marlin_template_kernel_src":1395,"kernel_":1396,"set_source_files_properties":1397,"properties":1398,"compile_flags":1399,"global":1400,"template":1401,"stub":1402,"marlin_srcs":1403,"dense":1404,"marlin_cuda_kernel":1405,"marlin_24_cuda_kernel":1406,"qqq":1407,"marlin_qqq_gemm_kernel":1408,"gptq_marlin_repack":1409,"awq_marlin_repack":1410,"allspark":1411,"allspark_archs":1412,"allspark_srcs":1413,"gptq_allspark":1414,"allspark_repack":1415,"allspark_qgemm_w8a16":1416,"scaled_mm_3x_archs":1417,"cutlass_scaled_mm":1418,"c3x":1419,"require":1420,"scaled_mm_archs":1421,"0a":1422,"scaled_mm_c3x_sm90":1423,"scaled_mm_sm90_fp8":1424,"scaled_mm_sm90_int8":1425,"scaled_mm_azp_sm90_int8":1426,"scaled_mm_blockwise_sm90_fp8":1427,"denable_scaled_mm_sm90":1428,"scaled_mm_c2x":1429,"know":1430,"compiler":1431,"recommend":1432,"upgrading":1433,"intend":1434,"quantized":1435,"geforce":1436,"blackwell":1437,"sm120":1438,"scaled_mm_c3x_sm120":1439,"scaled_mm_sm120_fp8":1440,"scaled_mm_blockwise_sm120_fp8":1441,"denable_scaled_mm_sm120":1442,"scaled_mm_c3x_120":1443,"sm100":1444,"scaled_mm_c3x_sm100":1445,"scaled_mm_sm100_fp8":1446,"scaled_mm_blockwise_sm100_fp8":1447,"denable_scaled_mm_sm100":1448,"scaled_mm_c3x_100":1449,"c2x":1450,"3x":1451,"scaled_mm_2x_archs":1452,"subtract":1453,"remove_item":1454,"denable_scaled_mm_c2x":1455,"covered":1456,"scaled_mm_c3x":1457,"cutlass_scaled_sparse_mm":1458,"cutlass_compressor":1459,"work":1460,"sparse_scaled_mm_c3x":1461,"denable_sparse_scaled_mm_c3x":1462,"nvfp4_scaled_mm_sm120":1463,"fp4_archs":1464,"nvfp4_quant_kernels":1465,"nvfp4_scaled_mm_sm120_kernels":1466,"denable_nvfp4_sm120":1467,"nvfp4":1468,"were":1469,"clear":1470,"nvfp4_experts_quant":1471,"nvfp4_scaled_mm_kernels":1472,"denable_nvfp4_sm100":1473,"denable_cutlass_moe_sm100":1474,"mla_archs":1475,"cutlass_mla_kernels":1476,"sm100_cutlass_mla_kernel":1477,"denable_cutlass_mla":1478,"add":1479,"specific":1480,"include_directories":1481,"cutlass_dir":1482,"examples":1483,"77_blackwell_fmha":1484,"moe":1485,"kernel":1486,"cutlass_moe_mm":1487,"get_cutlass_":1488,"pplx_":1489,"moe_mm_data":1490,"possible":1491,"grouped_mm_c3x_sm90":1492,"denable_cutlass_moe_sm90":1493,"grouped_mm_c3x":1494,"grouped_mm_c3x_sm100":1495,"moe_data":1496,"cutlass_moe_data_archs":1497,"blockwise_scaled_group_mm_sm100":1498,"something":1499,"sm90a":1500,"machete_archs":1501,"machete_gen_script":1502,"machete_gen_script_hash":1503,"machete_generation_result":1504,"machete_generation_output":1505,"machete_generation":1506,"generated":1507,"machete_gen_sources":1508,"machete_pytorch":1509,"w4a16":1510,"quickreduce":1511,"custom_quickreduce":1512,"cutlass_include_dir":1513,"cutlass_tools_util_include_dir":1514,"uses":1515,"cudagetdriverentrypointbyversion":1516,"wrapper":1517,"calling":1518,"causes":1519,"problems":1520,"linking":1521,"earlier":1522,"setting":1523,"sidesteps":1524,"issue":1525,"target_compile_definitions":1526,"private":1527,"cutlass_enable_direct_cuda_driver_call":1528,"vllm_moe_ext_src":1529,"moe_align_sum_kernels":1530,"topk_softmax_kernels":1531,"moe_wna16":1532,"moe_permute_src":1533,"permute_unpermute_kernels":1534,"moe_permute_unpermute_kernel":1535,"moe_permute_unpermute_op":1536,"vllm_moe_wna16_src":1537,"marlin_moe_archs":1538,"moe_marlin_gen_script":1539,"marlin_moe_wna16":1540,"moe_marlin_gen_script_hash":1541,"moe_marlin_generation_result":1542,"moe_marlin_generation_output":1543,"moe_marlin_generation":1544,"moe_wnaa16_marlin_src":1545,"vllm_rocm_ext_src":1546,"skinny_gemms":1547,"ship":1548,"projects":1549,"external_projects":1550,"flashmla":1551,"overwrites":1552,"releasing":1553,"releases":1554,"offer":1555,"reliable":1556,"packaged":1557,"binary":1558,"conveniently":1559,"accessed":1560,"via":1561,"serve":1562,"milestones":1563,"communicate":1564,"newly":1565,"improvements":1566,"upcoming":1567,"changes":1568,"affect":1569,"breaking":1570,"versioning":1571,"right":1572,"shifted":1573,"where":1574,"new":1575,"every":1576,"weeks":1577,"bug":1578,"opposed":1579,"semver":1580,"critical":1581,"made":1582,"post1":1583,"_major_":1584,"milestone":1585,"incompatible":1586,"similar":1587,"_minor_":1588,"_patch_":1589,"_post1_":1590,"_patch":1591,"1_":1592,"explicit":1593,"implicit":1594,"cadence":1595,"bi":1596,"weekly":1597,"days":1598,"future":1599,"dates":1600,"below":1601,"tentative":1602,"date":1603,"jan":1604,"feb":1605,"mar":1606,"apr":1607,"jun":1608,"jul":1609,"aug":1610,"14":1611,"15":1612,"16":1613,"17":1614,"oct":1615,"18":1616,"19":1617,"nov":1618,"21":1619,"dec":1620,"22":1621,"dedicated":1622,"performed":1623,"previously":1624,"reused":1625,"triggered":1626,"push":1627,"rc":1628,"tag":1629,"vx":1630,"rc1":1631,"enables":1632,"test":1633,"multiple":1634,"rcs":1635,"trigger":1636,"notes":1637,"monitor":1638,"reverts":1639,"apply":1640,"cherry":1641,"pick":1642,"criteria":1643,"approach":1644,"finalizing":1645,"allowed":1646,"land":1647,"pr":1648,"typically":1649,"sufficient":1650,"complete":1651,"thorough":1652,"round":1653,"stable":1654,"regression":1655,"address":1656,"functional":1657,"performance":1658,"recent":1659,"severe":1660,"silent":1661,"incorrectness":1662,"crashes":1663,"deadlocks":1664,"leaks":1665,"introduced":1666,"change":1667,"identifiers":1668,"prs":1669,"considered":1670,"merged":1671,"trunk":1672,"manual":1673,"validations":1674,"e2e":1675,"validation":1676,"regressions":1677,"benchmark":1678,"workflow":1679,"actions":1680,"workflows":1681,"yml":1682,"coverage":1683,"llama3":1684,"llama4":1685,"hardware":1686,"h100":1687,"mi300x":1688,"_note":1689,"based":1690,"availability_":1691,"access":1692,"review":1693,"familiarize":1694,"yourself":1695,"configurations":1696,"tree":1697,"benchmarks":1698,"navigate":1699,"v0":1700,"once":1701,"completes":1702,"dashboard":1703,"hud":1704,"reponame":1705,"2fvllm":1706,"corresponding":1707,"comparison":1708,"compare":1709,"verify":1710,"occurred":1711,"vs":1712,"starttime":1713,"thu":1714,"2c":1715,"2017":1716,"20apr":1717,"202025":1718,"2021":1719,"3a43":1720,"3a50":1721,"20gmt":1722,"stoptime":1723,"wed":1724,"2016":1725,"20jul":1726,"granularity":1727,"week":1728,"lbranch":1729,"lcommit":1730,"b6553be1bc75f046b00046a4ad7576364d03c835":1731,"rbranch":1732,"rcommit":1733,"a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f":1734,"benchmarkname":1735,"modelname":1736,"20models":1737,"backendname":1738,"20backends":1739,"modename":1740,"20modes":1741,"dtypename":1742,"20dtype":1743,"devicename":1744,"20devices":1745,"archname":1746,"20platforms":1747,"conduct":1748,"pledge":1749,"members":1750,"leaders":1751,"participation":1752,"harassment":1753,"experience":1754,"regardless":1755,"age":1756,"body":1757,"size":1758,"visible":1759,"invisible":1760,"disability":1761,"ethnicity":1762,"sex":1763,"characteristics":1764,"gender":1765,"identity":1766,"education":1767,"socioeconomic":1768,"nationality":1769,"personal":1770,"appearance":1771,"race":1772,"caste":1773,"religion":1774,"sexual":1775,"orientation":1776,"act":1777,"interact":1778,"ways":1779,"contribute":1780,"welcoming":1781,"diverse":1782,"inclusive":1783,"healthy":1784,"standards":1785,"behavior":1786,"contributes":1787,"positive":1788,"demonstrating":1789,"empathy":1790,"kindness":1791,"toward":1792,"people":1793,"being":1794,"respectful":1795,"differing":1796,"opinions":1797,"viewpoints":1798,"experiences":1799,"giving":1800,"gracefully":1801,"accepting":1802,"constructive":1803,"feedback":1804,"responsibility":1805,"apologizing":1806,"those":1807,"affected":1808,"mistakes":1809,"learning":1810,"best":1811,"individuals":1812,"overall":1813,"unacceptable":1814,"sexualized":1815,"imagery":1816,"advances":1817,"kind":1818,"trolling":1819,"insulting":1820,"derogatory":1821,"comments":1822,"political":1823,"attacks":1824,"public":1825,"publishing":1826,"others":1827,"physical":1828,"email":1829,"without":1830,"permission":1831,"reasonably":1832,"inappropriate":1833,"professional":1834,"enforcement":1835,"responsibilities":1836,"responsible":1837,"clarifying":1838,"enforcing":1839,"acceptable":1840,"take":1841,"appropriate":1842,"fair":1843,"corrective":1844,"action":1845,"response":1846,"deem":1847,"threatening":1848,"offensive":1849,"harmful":1850,"reject":1851,"wiki":1852,"edits":1853,"aligned":1854,"reasons":1855,"moderation":1856,"decisions":1857,"scope":1858,"applies":1859,"within":1860,"spaces":1861,"individual":1862,"representing":1863,"posting":1864,"social":1865,"account":1866,"acting":1867,"appointed":1868,"representative":1869,"online":1870,"offline":1871,"irl":1872,"instances":1873,"abusive":1874,"harassing":1875,"otherwise":1876,"reported":1877,"channel":1878,"complaints":1879,"reviewed":1880,"investigated":1881,"promptly":1882,"fairly":1883,"obligated":1884,"respect":1885,"privacy":1886,"reporter":1887,"incident":1888,"guidelines":1889,"follow":1890,"impact":1891,"determining":1892,"consequences":1893,"violation":1894,"correction":1895,"deemed":1896,"unprofessional":1897,"unwelcome":1898,"consequence":1899,"written":1900,"clarity":1901,"around":1902,"nature":1903,"explanation":1904,"why":1905,"apology":1906,"requested":1907,"series":1908,"continued":1909,"interaction":1910,"unsolicited":1911,"period":1912,"includes":1913,"avoiding":1914,"interactions":1915,"well":1916,"channels":1917,"violating":1918,"terms":1919,"lead":1920,"permanent":1921,"ban":1922,"serious":1923,"sustained":1924,"communication":1925,"during":1926,"pattern":1927,"aggression":1928,"disparagement":1929,"classes":1930,"attribution":1931,"contributor":1932,"covenant":1933,"code_of_conduct":1934,"inspired":1935,"mozilla":1936,"ladder":1937,"inclusion":1938,"answers":1939,"faq":1940,"translations":1941,"traceback":1942,"typing":1943,"callable":1944,"unittest":1945,"mock":1946,"find_cuda_init":1947,"fn":1948,"object":1949,"helper":1950,"function":1951,"initialization":1952,"errors":1953,"initializes":1954,"prints":1955,"stack":1956,"trace":1957,"happens":1958,"_lazy_init":1959,"nonlocal":1960,"extract_stack":1961,"initialized":1962,"format_list":1963,"__main__":1964,"import_module":1965,"policy":1966,"reporting":1967,"report":1968,"privately":1969,"vulnerability":1970,"submission":1971,"form":1972,"triage":1973,"reports":1974,"triaged":1975,"vulnerability_management":1976,"threat":1977,"guide":1978,"usage":1979,"assumptions":1980,"recommendations":1981,"securely":1982,"severity":1983,"risk":1984,"taking":1985,"dealing":1986,"past":1987,"defaults":1988,"cases":1989,"categories":1990,"vulnerabilities":1991,"allow":1992,"attackers":1993,"execute":1994,"arbitrary":1995,"significantly":1996,"compromise":1997,"confidentiality":1998,"integrity":1999,"privileges":2000,"needed":2001,"network":2002,"deserialization":2003,"exploit":2004,"chains":2005,"generally":2006,"rated":2007,"cvss":2008,"flaws":2009,"elevated":2010,"rce":2011,"contexts":2012,"significant":2013,"loss":2014,"advanced":2015,"conditions":2016,"trust":2017,"modes":2018,"node":2019,"privileged":2020,"scores":2021,"moderate":2022,"cause":2023,"denial":2024,"service":2025,"partial":2026,"disruption":2027,"breach":2028,"rating":2029,"low":2030,"informational":2031,"exploitable":2032,"weaknesses":2033,"privilege":2034,"negligible":2035,"side":2036,"collisions":2037,"often":2038,"less":2039,"prenotification":2040,"prenotify":2041,"vendors":2042,"purpose":2043,"coordinated":2044,"notification":2045,"contacts":2046,"advisory":2047,"few":2048,"added":2049,"send":2050,"vendor":2051,"analyzed":2052,"case":2053,"withdraw":2054,"receiving":2055,"prenotifications":2056,"membership":2057,"refinements":2058,"who":2059,"fill":2060,"description":2061,"ensuring":2062,"checklist":2063,"bottom":2064,"essential":2065,"elements":2066,"effective":2067,"fix":2068,"resolve":2069,"pasting":2070,"necessary":2071,"updating":2072,"submitting":2073,"anything":2074,"regex":2075,"higher":2076,"matching":2077,"cachetools":2078,"psutil":2079,"sentencepiece":2080,"tokenizer":2081,"numpy":2082,"tqdm":2083,"blake3":2084,"cpuinfo":2085,"transformers":2086,"tokenizers":2087,"incremental":2088,"detokenization":2089,"protobuf":2090,"llamatokenizer":2091,"fastapi":2092,"115":2093,"transcriptions":2094,"endpoint":2095,"aiohttp":2096,"99":2097,"responses":2098,"reasoning":2099,"pydantic":2100,"prometheus_client":2101,"pillow":2102,"image":2103,"prometheus":2104,"instrumentator":2105,"tiktoken":2106,"dbrx":2107,"lm":2108,"enforcer":2109,"llguidance":2110,"platform_machine":2111,"x86_64":2112,"arm64":2113,"aarch64":2114,"outlines_core":2115,"outlines":2116,"disk":2117,"diskcache":2118,"lark":2119,"xgrammar":2120,"typing_extensions":2121,"filelock":2122,"tox":2123,"pull":2124,"317":2125,"parser":2126,"parsing":2127,"pyzmq":2128,"25":2129,"msgspec":2130,"importlib_metadata":2131,"python_version":2132,"opencv":2133,"headless":2134,"io":2135,"pyyaml":2136,"six":2137,"transitive":2138,"needs":2139,"77":2140,"80":2141,"triton":2142,"modern":2143,"distutils":2144,"einops":2145,"qwen2":2146,"vl":2147,"compressed":2148,"tensors":2149,"depyf":2150,"profiling":2151,"debugging":2152,"config":2153,"cloudpickle":2154,"pickling":2155,"registry":2156,"watchfiles":2157,"http":2158,"updates":2159,"tls":2160,"logging_configuration":2161,"scipy":2162,"phi":2163,"instruct":2164,"pybase64":2165,"base64":2166,"implementation":2167,"cbor2":2168,"cross":2169,"serialization":2170,"hashable":2171,"objects":2172,"setproctitle":2173,"better":2174,"monitoring":2175,"harmony":2176,"gpt":2177,"oss":2178,"extra":2179,"rocm6":2180,"torchvision":2181,"torchaudio":2182,"24":2183,"scm":2184,"jinja2":2185,"amdsmi":2186,"entrypoints":2187,"tests":2188,"audioread":2189,"cffi":2190,"decorator":2191,"lazy":2192,"platformdirs":2193,"pooch":2194,"pycparse":2195,"soxr":2196,"test_video":2197,"decord":2198,"sentence":2199,"test_score":2200,"basic":2201,"matplotlib":2202,"extended":2203,"blobfile":2204,"formatting":2205,"pre":2206,"numba":2207,"60":2208,"61":2209,"gram":2210,"x86":2211,"151218":2212,"platform_system":2213,"ppc64le":2214,"17960":2215,"processor":2216,"minicpm":2217,"2_6":2218,"alongside":2219,"s390x":2220,"phi3v":2221,"openmp":2222,"intel_extension_for_pytorch":2223,"imported":2224,"gather":2225,"optimize":2226,"arm":2227,"neoverse":2228,"cores":2229,"mkdocs":2230,"autonav":2231,"material":2232,"mkdocstrings":2233,"gen":2234,"awesome":2235,"nav":2236,"glightbox":2237,"localized":2238,"plugin":2239,"minify":2240,"markdown":2241,"math":2242,"ruff":2243,"argparse":2244,"hook":2245,"zmq":2246,"uvloop":2247,"client":2248,"autogenerated":2249,"uv":2250,"strategy":2251,"unsafe":2252,"cu128":2253,"absl":2254,"rouge":2255,"score":2256,"accelerate":2257,"eval":2258,"peft":2259,"aenum":2260,"lightly":2261,"affine":2262,"rasterio":2263,"aiohappyeyeballs":2264,"cors":2265,"fsspec":2266,"aiosignal":2267,"albucore":2268,"terratorch":2269,"albumentations":2270,"alembic":2271,"mlflow":2272,"annotated":2273,"antlr4":2274,"hydra":2275,"omegaconf":2276,"anyio":2277,"httpx":2278,"starlette":2279,"argcomplete":2280,"datamodel":2281,"generator":2282,"arrow":2283,"isoduration":2284,"attrs":2285,"fiona":2286,"hypothesis":2287,"jsonlines":2288,"jsonschema":2289,"pytest":2290,"subtests":2291,"referencing":2292,"backoff":2293,"schemathesis":2294,"bitsandbytes":2295,"46":2296,"lightning":2297,"black":2298,"blinker":2299,"flask":2300,"bm25s":2301,"mteb":2302,"35":2303,"57":2304,"botocore":2305,"s3transfer":2306,"bounded":2307,"pool":2308,"executor":2309,"pqdm":2310,"buildkite":2311,"collector":2312,"auth":2313,"skinny":2314,"certifi":2315,"httpcore":2316,"pyogrio":2317,"pyproj":2318,"chardet":2319,"mbstrdecoder":2320,"charset":2321,"normalizer":2322,"click":2323,"plugins":2324,"cligj":2325,"jiwer":2326,"nltk":2327,"typer":2328,"uvicorn":2329,"colorama":2330,"sacrebleu":2331,"multiprocess":2332,"colorful":2333,"contourpy":2334,"cramjam":2335,"fastparquet":2336,"cupy":2337,"cuda12x":2338,"cycler":2339,"sdk":2340,"59":2341,"dataproperty":2342,"pytablewriter":2343,"tabledata":2344,"evaluate":2345,"dill":2346,"distlib":2347,"virtualenv":2348,"dnspython":2349,"validator":2350,"docopt":2351,"num2words":2352,"docstring":2353,"jsonargparse":2354,"efficientnet":2355,"segmentation":2356,"encodec":2357,"torchgeo":2358,"vector":2359,"quantize":2360,"vocos":2361,"einx":2362,"backport":2363,"116":2364,"genai":2365,"perf":2366,"fastrlock":2367,"hub":2368,"fonttools":2369,"fqdn":2370,"frozendict":2371,"frozenlist":2372,"ftfy":2373,"clip":2374,"genson":2375,"geopandas":2376,"gitdb":2377,"gitpython":2378,"44":2379,"opencensus":2380,"40":2381,"googleapis":2382,"protos":2383,"70":2384,"graphene":2385,"graphql":2386,"relay":2387,"greenlet":2388,"sqlalchemy":2389,"grpcio":2390,"71":2391,"gunicorn":2392,"h11":2393,"h5py":2394,"harfile":2395,"hf":2396,"xet":2397,"hiredis":2398,"34":2399,"timm":2400,"humanize":2401,"131":2402,"idna":2403,"yarl":2404,"imageio":2405,"37":2406,"scikit":2407,"opentelemetry":2408,"typeshed":2409,"inflect":2410,"iniconfig":2411,"isort":2412,"itsdangerous":2413,"jmespath":2414,"joblib":2415,"jsonpointer":2416,"specifications":2417,"junit":2418,"xml":2419,"kaleido":2420,"kiwisolver":2421,"kornia":2422,"rs":2423,"libnacl":2424,"post0":2425,"utilities":2426,"torchmetrics":2427,"llvmlite":2428,"lxml":2429,"mako":2430,"rich":2431,"markupsafe":2432,"werkzeug":2433,"pycocotools":2434,"typepy":2435,"mdurl":2436,"itertools":2437,"mpmath":2438,"sympy":2439,"msgpack":2440,"38":2441,"multidict":2442,"munch":2443,"pretrainedmodels":2444,"mypy":2445,"networkx":2446,"numexpr":2447,"patsy":2448,"rioxarray":2449,"shapely":2450,"statsmodels":2451,"tensorboardx":2452,"tifffile":2453,"tritonclient":2454,"xarray":2455,"cublas":2456,"cu12":2457,"cudnn":2458,"cusolver":2459,"cupti":2460,"nvrtc":2461,"cufft":2462,"41":2463,"cufile":2464,"curand":2465,"cusparse":2466,"53":2467,"cusparselt":2468,"nccl":2469,"nvjitlink":2470,"nvtx":2471,"32":2472,"86":2473,"exporter":2474,"semantic":2475,"conventions":2476,"56b0":2477,"proto":2478,"36":2479,"plotly":2480,"rerunfailures":2481,"pathspec":2482,"pathvalidate":2483,"pluggy":2484,"polars":2485,"29":2486,"portalocker":2487,"propcache":2488,"plus":2489,"28":2490,"forked":2491,"spy":2492,"pyarrow":2493,"pyasn1":2494,"rsa":2495,"pybind11":2496,"pycountry":2497,"pycparser":2498,"pycryptodomex":2499,"33":2500,"pygments":2501,"pyparsing":2502,"pyrate":2503,"limiter":2504,"pystemmer":2505,"asyncio":2506,"shard":2507,"timeout":2508,"box":2509,"dateutil":2510,"rapidjson":2511,"pytrec":2512,"terrier":2513,"pytz":2514,"rapidfuzz":2515,"48":2516,"redis":2517,"testclient":2518,"rfc3339":2519,"rfc3987":2520,"rpds":2521,"rtree":2522,"safetensors":2523,"39":2524,"shellingham":2525,"smart":2526,"smmap":2527,"sniffio":2528,"sortedcontainers":2529,"sqlitedict":2530,"sqlparse":2531,"tabulate":2532,"tcolorpy":2533,"tenacity":2534,"1rc2":2535,"threadpoolctl":2536,"tomli":2537,"66":2538,"stream":2539,"51":2540,"20241206":2541,"inspection":2542,"tzdata":2543,"uri":2544,"urllib3":2545,"31":2546,"wcwidth":2547,"webcolors":2548,"word2number":2549,"wrapt":2550,"xxhash":2551,"zipp":2552,"zstandard":2553,"lmcache":2554,"lint":2555,"modify":2556,"two":2557,"referenced":2558,"phi4mm":2559,"kimi":2560,"mpt":2561,"qwen":2562,"minicpmo_26":2563,"cgraph":2564,"internvl":2565,"transformers_stream_generator":2566,"voxtral":2567,"smolvlm":2568,"datamodel_code_generator":2569,"minicpm3":2570,"evaluation":2571,"52":2572,"schema":2573,"genai_perf":2574,"leads":2575,"mirrored":2576,"vision":2577,"tab":2578,"readme":2579,"ov":2580,"facebookresearch":2581,"xformers":2582,"devices":2583,"neuronx":2584,"cc":2585,"0a0":2586,"preprocessing":2587,"45":2588,"conch":2589,"78":2590,"nixl":2591,"torch_xla":2592,"links":2593,"storage":2594,"libtpu":2595,"jax":2596,"jax_nightly_releases":2597,"jaxlib_nightly_releases":2598,"dev20250730":2599,"pallas":2600,"xla":2601,"tpuvm":2602,"cp311":2603,"linux_x86_64":2604,"cp312":2605,"temporarily":2606,"scalar_type":2607,"scalar_types":2608,"mark":2609,"parametrize":2610,"type_tuple":2611,"uint4":2612,"uint4b8":2613,"128":2614,"127":2615,"uint8b128":2616,"float4_e2m1f":2617,"float6_e3m2f":2618,"uint8":2619,"float8_e5m2":2620,"float8_e4m3fn":2621,"bfloat16":2622,"float16_e8m7":2623,"float16":2624,"float16_e5m10":2625,"ids":2626,"test_scalar_type_min_max":2627,"min":2628,"torch_type":2629,"is_floating_point":2630,"finfo":2631,"iinfo":2632,"functools":2633,"signal":2634,"contextlib":2635,"contextmanager":2636,"multiprocessing":2637,"literal":2638,"union":2639,"nn":2640,"completion":2641,"paramspec":2642,"texttextlogprobs":2643,"ensure_model_parallel_initialized":2644,"init_distributed_environment":2645,"engine":2646,"arg_utils":2647,"asyncengineargs":2648,"cli":2649,"servesubcommand":2650,"model_loader":2651,"get_model_loader":2652,"platforms":2653,"current_platform":2654,"transformers_utils":2655,"get_tokenizer":2656,"flexibleargumentparser":2657,"gb_bytes":2658,"cuda_device_count_stateless":2659,"get_open_port":2660,"is_rocm":2661,"amdsmi_get_gpu_vram_usage":2662,"amdsmi_get_processor_handles":2663,"amdsmi_init":2664,"amdsmi_shut_down":2665,"_nvml":2666,"yield":2667,"is_cuda":2668,"third_party":2669,"pynvml":2670,"nvmldevicegethandlebyindex":2671,"nvmldevicegetmemoryinfo":2672,"nvmlinit":2673,"nvmlshutdown":2674,"vllm_path":2675,"remoteopenaiserver":2676,"dummy_api_key":2677,"token":2678,"abc123":2679,"_start_server":2680,"vllm_serve_args":2681,"env_dict":2682,"subclasses":2683,"method":2684,"customize":2685,"launch":2686,"initialize":2687,"safe":2688,"spawn":2689,"vllm_worker_multiproc_method":2690,"proc":2691,"popen":2692,"stderr":2693,"seed":2694,"auto_port":2695,"max_wait_seconds":2696,"float":2697,"port":2698,"unix":2699,"sockets":2700,"uds":2701,"don":2702,"mutate":2703,"args":2704,"subparsers":2705,"add_subparsers":2706,"dest":2707,"subparser":2708,"subparser_init":2709,"parse_args":2710,"host":2711,"localhost":2712,"show_hidden_metrics":2713,"show_hidden_metrics_for_version":2714,"starting":2715,"is_local":2716,"isdir":2717,"engine_args":2718,"from_cli_args":2719,"model_config":2720,"create_model_config":2721,"load_config":2722,"create_load_config":2723,"download_model":2724,"240":2725,"_wait_for_server":2726,"url_for":2727,"health":2728,"__enter__":2729,"__exit__":2730,"exc_type":2731,"exc_value":2732,"terminate":2733,"wait":2734,"timeoutexpired":2735,"kill":2736,"_poll":2737,"polling":2738,"poll":2739,"transport":2740,"httptransport":2741,"while":2742,"status_code":2743,"break":2744,"raised":2745,"means":2746,"ready":2747,"useful":2748,"exited":2749,"unexpectedly":2750,"sleep":2751,"property":2752,"url_root":2753,"parts":2754,"get_client":2755,"kwargs":2756,"600":2757,"base_url":2758,"api_key":2759,"max_retries":2760,"get_async_client":2761,"asyncopenai":2762,"remoteopenaiservercustom":2763,"custom":2764,"child":2765,"child_process_fxn":2766,"ignore":2767,"assignment":2768,"store":2769,"invoke":2770,"superclass":2771,"constructor":2772,"indirectly":2773,"exitcode":2774,"is_alive":2775,"_test_completion":2776,"prompt":2777,"token_ids":2778,"completions":2779,"max_tokens":2780,"temperature":2781,"single_completion":2782,"choices":2783,"finish_reason":2784,"seeded":2785,"random":2786,"seeded_sampling":2787,"prompts":2788,"choice":2789,"simple":2790,"batch":2791,"simple_list":2792,"text0":2793,"text1":2794,"texts":2795,"chunk":2796,"_test_completion_close":2797,"logprobs":2798,"top_logprobs":2799,"completion_close":2800,"_test_chat":2801,"role":2802,"chat_response":2803,"_test_embeddings":2804,"embeddings":2805,"encoding_format":2806,"single_embedding":2807,"_test_image_text":2808,"model_name":2809,"image_url":2810,"pure":2811,"today":2812,"chat_completion":2813,"logprob":2814,"pure_text":2815,"text_image":2816,"compare_two_settings":2817,"arg1":2818,"arg2":2819,"env1":2820,"env2":2821,"different":2822,"arguments":2823,"environments":2824,"compare_all_settings":2825,"all_args":2826,"all_envs":2827,"several":2828,"argument":2829,"dictionaries":2830,"trust_remote_code":2831,"tokenizer_mode":2832,"auto":2833,"mode":2834,"can_force_load_format":2835,"load":2836,"hello":2837,"my":2838,"input_ids":2839,"ref_results":2840,"enumerate":2841,"zip":2842,"comparing":2843,"usually":2844,"weights":2845,"dummy":2846,"vllm_test_force_load_format":2847,"compare_results":2848,"served_model":2849,"models_list":2850,"generate_close":2851,"generate_chat":2852,"generate_with_image":2853,"upload":2854,"wikimedia":2855,"wikipedia":2856,"commons":2857,"0b":2858,"rgba_comp":2859,"encode":2860,"fails":2861,"ref_args":2862,"ref_envs":2863,"compare_args":2864,"compare_envs":2865,"ref_result":2866,"compare_result":2867,"deepcopy":2868,"sim":2869,"cosine_similarity":2870,"dim":2871,"999":2872,"del":2873,"init_test_distributed_environment":2874,"tp_size":2875,"pp_size":2876,"rank":2877,"distributed_init_port":2878,"local_rank":2879,"distributed_init_method":2880,"tcp":2881,"world_size":2882,"multi_process_parallel":2883,"monkeypatch":2884,"test_target":2885,"helps":2886,"compared":2887,"working_dir":2888,"workers":2889,"gitignore":2890,"excluding":2891,"move":2892,"dir":2893,"ray_runtime_env_ignore_gitignore":2894,"init":2895,"runtime_env":2896,"excludes":2897,"shellcheck":2898,"dist":2899,"refs":2900,"shutdown":2901,"error_on_warning":2902,"category":2903,"manager":2904,"fail":2905,"emitted":2906,"catch_warnings":2907,"filterwarnings":2908,"get_physical_device_indices":2909,"visible_devices":2910,"cuda_visible_devices":2911,"visible_indices":2912,"index_mapping":2913,"wait_for_gpu_memory_to_clear":2914,"threshold_bytes":2915,"threshold_ratio":2916,"timeout_s":2917,"120":2918,"nvml":2919,"measurement":2920,"start_time":2921,"output_raw":2922,"tuple":2923,"dev_handle":2924,"mem_info":2925,"gb_used":2926,"vram_used":2927,"gb_total":2928,"vram_total":2929,"total":2930,"02f":2931,"gib":2932,"is_free":2933,"threshold":2934,"2f":2935,"dur_s":2936,"values":2937,"waiting":2938,"_p":2939,"fork_new_process_for_each_test":2940,"fork":2941,"7053":2942,"wraps":2943,"leader":2944,"own":2945,"sending":2946,"sigterm":2947,"setpgrp":2948,"_pytest":2949,"outcomes":2950,"skipped":2951,"pid":2952,"convert":2953,"_exit":2954,"print_exc":2955,"pgid":2956,"getpgid":2957,"_pid":2958,"_exitcode":2959,"waitpid":2960,"itself":2961,"old_signal_handler":2962,"sig_ign":2963,"processes":2964,"killpg":2965,"restore":2966,"handler":2967,"called":2968,"spawn_new_process_for_each_test":2969,"running_in_subprocess":2970,"set_start_method":2971,"__module__":2972,"temporarydirectory":2973,"tempdir":2974,"output_filepath":2975,"new_process":2976,"tmp":2977,"complex":2978,"input_bytes":2979,"dumps":2980,"cmd":2981,"returned":2982,"successful":2983,"check_returncode":2984,"wrap":2985,"provide":2986,"create_new_process_for_each_test":2987,"creates":2988,"runs":2989,"creation":2990,"separate":2991,"use_spawn":2992,"is_xpu":2993,"large_gpu_mark":2994,"min_gb":2995,"markdecorator":2996,"skips":2997,"meet":2998,"minimum":2999,"requirement":3000,"gb":3001,"leveraged":3002,"large_gpu_test":3003,"enough":3004,"filtering":3005,"is_cpu":3006,"memory_gb":3007,"get_device_total_memory":3008,"finding":3009,"stacklevel":3010,"skipif":3011,"reason":3012,"decorate":3013,"machine":3014,"l4":3015,"vram":3016,"multi_gpu_marks":3017,"num_gpus":3018,"collection":3019,"marks":3020,"multi_gpu_test":3021,"test_selector":3022,"test_skipif":3023,"func":3024,"reversed":3025,"async":3026,"completions_with_server_args":3027,"server_cli_args":3028,"num_logprobs":3029,"construct":3030,"obtain":3031,"spin":3032,"interval":3033,"bringing":3034,"240sec":3035,"max_token":3036,"instance":3037,"isinstance":3038,"max_tok":3039,"await":3040,"call":3041,"get_client_text_generations":3042,"tokens":3043,"protocol":3044,"get_client_text_logprob_generations":3045,"operates":3046,"obtains":3047,"top":3048,"sequencegroup":3049,"text_generations":3050,"has_module_attribute":3051,"attribute_name":3052,"attribute":3053,"hasattr":3054,"importerror":3055,"get_attn_backend_list_based_on_platform":3056,"flash_attn_vllm_v1":3057,"triton_attn_vllm_v1":3058,"tree_attn":3059,"attn_backend_list":3060,"aiter":3061,"noqa":3062,